КАКерамика_моя_старая_база/src/InformationRegisters/ПараметрыТорговыхТочек/ПараметрыТорговыхТочек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыТорговыхТочек</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КодПоОКТМО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипТорговойТочки</name>
    <type>
      <types>EnumRef.ТипыТорговыхТочек</types>
    </type>
  </resources>
  <resources>
    <name>ВидТорговойДеятельности</name>
    <type>
      <types>EnumRef.ВидыТорговойДеятельностиОблагаемыеСбором</types>
    </type>
  </resources>
  <resources>
    <name>ОснованиеПользования</name>
    <type>
      <types>EnumRef.ОснованияПользованияТорговойТочкой</types>
    </type>
  </resources>
  <resources>
    <name>ПостановкаНаУчетВНалоговомОргане</name>
    <type>
      <types>EnumRef.ПостановкаНаУчетВНалоговомОргане</types>
    </type>
  </resources>
  <resources>
    <name>НалоговыйОрган</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </resources>
  <resources>
    <name>ВидОбъектаНедвижимости</name>
    <type>
      <types>EnumRef.ВидыОбъектовНедвижимостиОблагаемыхТорговымСбором</types>
    </type>
  </resources>
  <resources>
    <name>КадастровыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПлощадьТорговогоЗала</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодНалоговойЛьготы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЛьготы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСбора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Уведомление</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПодачиУведомления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийТорговыеТочки</types>
    </type>
  </attributes>
  <attributes>
    <name>РасшифровкаРасчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТорговаяТочка</name>
    <type>
      <types>CatalogRef.ТорговыеТочки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/ВидыУведомленийОСпецрежимахНалогообложения/ВидыУведомленийОСпецрежимахНалогообложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУведомленийОСпецрежимахНалогообложения</name>
  <enumValues>
    <name>УведомлениеОПереходеНаУСН</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбУтратеПраваНаУСН</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбОтказеОтУСН</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбИзмененииОбъектаНалогообложенияПоУСН</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОПрекращенииДеятельностиПоУСН</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаПолучениеПатента</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаПолучениеПатентаРекомендованнаяФорма</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОбУтратеПраваНаПатент</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОПрекращенииДеятельностиПоПатентнойСистеме</name>
  </enumValues>
  <enumValues>
    <name>ФормаЕНВД1</name>
  </enumValues>
  <enumValues>
    <name>ФормаЕНВД2</name>
  </enumValues>
  <enumValues>
    <name>ФормаЕНВД3</name>
  </enumValues>
  <enumValues>
    <name>ФормаЕНВД4</name>
  </enumValues>
  <enumValues>
    <name>ФормаС09_1</name>
  </enumValues>
  <enumValues>
    <name>ФормаС09_2</name>
  </enumValues>
  <enumValues>
    <name>ФормаС09_3_1</name>
  </enumValues>
  <enumValues>
    <name>ФормаС09_3_2</name>
  </enumValues>
  <enumValues>
    <name>ФормаС09_4</name>
  </enumValues>
  <enumValues>
    <name>Форма_1_6_Учет</name>
  </enumValues>
  <enumValues>
    <name>ФормаУ_ИО</name>
  </enumValues>
  <enumValues>
    <name>ФормаТС1</name>
  </enumValues>
  <enumValues>
    <name>ФормаТС2</name>
  </enumValues>
  <enumValues>
    <name>ФормаС09_6</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеИсключенииПроверки</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеПостановкаОбъектаНВОС</name>
  </enumValues>
  <enumValues>
    <name>ФормаР21001</name>
  </enumValues>
  <enumValues>
    <name>ФормаР24001</name>
  </enumValues>
  <enumValues>
    <name>ФормаР11001</name>
  </enumValues>
  <enumValues>
    <name>ФормаР13001</name>
  </enumValues>
  <enumValues>
    <name>ФормаР13014</name>
  </enumValues>
  <enumValues>
    <name>ФормаР14001</name>
  </enumValues>
  <enumValues>
    <name>ФормаКИК</name>
  </enumValues>
  <enumValues>
    <name>СообщениеОНаделенииОППолномочиямиПоВыплатам</name>
  </enumValues>
  <enumValues>
    <name>ФормаСИО</name>
  </enumValues>
  <enumValues>
    <name>НевозможностьПредоставленияДокументов</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОВозвратеНалога</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОЗачетеНалога</name>
  </enumValues>
  <enumValues>
    <name>ДекларацияОХарактеристикахОбъектаНедвижимости</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОПредоставленииРассрочкиФСС</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОПримененииНалоговойЛьготыУчастникамиРегиональныхИнвестиционныхПроектов</name>
  </enumValues>
  <enumValues>
    <name>ПостановкаСнятиеВКачествеНалоговогоАгента</name>
  </enumValues>
  <enumValues>
    <name>СогласиеНаРаскрытиеНалоговойТайны</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеУчастникаСколково</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаПолучениеДокументаНалоговогоРезидента</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеУменьшениеНалогаККТ</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОсвобождениеОтСтраховыхВзносов</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбОткрытииЗакрытииСчета</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбИзмененииРеквизитовСчета</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОНаличииСчета</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПорядокПредставленияНалоговыхДеклараций</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеРанееПредставленныеДокументы</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеНДДДУС</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНДДДУС</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеКЛМК</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПрекращениеЕСХН</name>
  </enumValues>
  <enumValues>
    <name>ОсвобождениеОтНДСПриЕСХН</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеРегиональныхНалогов</name>
  </enumValues>
  <enumValues>
    <name>ОсвобождениеОтУплатыНДС</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОсвобождениеНалогНаПрибыльСколково</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОсвобождениеНДССколково</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСведенийСоставляющихНалоговуюТайну</name>
  </enumValues>
  <enumValues>
    <name>ВозвратСуммыНВОС</name>
  </enumValues>
  <enumValues>
    <name>ЗачетСуммыНВОС</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеЛьготаТранспортЗемля</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаПриемДокументовФСС</name>
  </enumValues>
  <enumValues>
    <name>Уведомление1НачалоУплаты</name>
  </enumValues>
  <enumValues>
    <name>Уведомление2ОтказОтУплаты</name>
  </enumValues>
  <enumValues>
    <name>ОтчетДДС</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаЕСХН</name>
  </enumValues>
  <enumValues>
    <name>ВыборНалоговогоОрганаНДФЛ</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПереходНПДЕСХН</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПереходНПДУСН</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПорядокУплатыПрибыль</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОГибелиТранспортногоСредства</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОПредоставленииРассрочкиПоНалоговымПлатежам</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеПорядкаИсчисленияАвансовПоНалогуНаПрибыль</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаСубсидиюДляЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>СубсидияНаПроведениеПрофилактики</name>
  </enumValues>
  <enumValues>
    <name>СогласиеНаИнформированиеОЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>ЖалобаФНС</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОПроведенииНалоговогоМониторинга</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияОбОрганизацииСистемыВнутреннегоКонтроля</name>
  </enumValues>
  <enumValues>
    <name>СообщениеТранспортЗемля</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияОбУчастниках</name>
  </enumValues>
  <enumValues>
    <name>УчетнаяПолитика</name>
  </enumValues>
  <enumValues>
    <name>РегламентИнформационногоВзаимодействия</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаСправкиПоРасчетам</name>
  </enumValues>
  <enumValues>
    <name>СверкаРасчетовПоНалогам</name>
  </enumValues>
  <enumValues>
    <name>РеестрДокументовПодтверждающихЛьготы</name>
  </enumValues>
  <enumValues>
    <name>УменьшениеНалогаНаСтраховыеВзносы</name>
  </enumValues>
  <enumValues>
    <name>ПередачаСообщенийОСуммахНалогов</name>
  </enumValues>
  <enumValues>
    <name>РискиОрганизацииНалоговыйМониторинг</name>
  </enumValues>
  <enumValues>
    <name>СтруктураВзаимосвязейВнутриГруппыКомпаний</name>
  </enumValues>
  <enumValues>
    <name>РасшифровкаПоОКВЭД</name>
  </enumValues>
  <enumValues>
    <name>КонтрольныеПроцедуры</name>
  </enumValues>
  <enumValues>
    <name>РезультатыВыполнения</name>
  </enumValues>
  <enumValues>
    <name>ОценкаСистемыВнутреннегоКонтроля</name>
  </enumValues>
  <enumValues>
    <name>МероприятияПоСовершенствованию</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияОРазницахБУиНУ</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияОРискахПоОтдельнымСделкам</name>
  </enumValues>
  <enumValues>
    <name>МатрицаРисковКП</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияУдельныйВес</name>
  </enumValues>
  <enumValues>
    <name>ГрафикПереходаНалоговыйМониторинг</name>
  </enumValues>
  <enumValues>
    <name>ДорожнаяКартаНМ</name>
  </enumValues>
  <enumValues>
    <name>ЗаявительныйПорядокВозмещенияНДСАкциз</name>
  </enumValues>
  <enumValues>
    <name>РеестрЛьготИмущество</name>
  </enumValues>
  <enumValues>
    <name>ЗапретПредставленияУполномоченнымиЛицами</name>
  </enumValues>
  <enumValues>
    <name>ЗапросМотивированногоМнения</name>
  </enumValues>
  <enumValues>
    <name>СогласиеСМотивированнымМнением</name>
  </enumValues>
  <enumValues>
    <name>РазногласиеСМотивированнымМнением</name>
  </enumValues>
  <enumValues>
    <name>ВзаимосогласительнаяПроцедура</name>
  </enumValues>
  <enumValues>
    <name>ИзъятиеТС</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОГибелиИмущества</name>
  </enumValues>
  <enumValues>
    <name>ЛьготаПоНалогуНаИмущество</name>
  </enumValues>
  <enumValues>
    <name>ФормаРГ00001</name>
  </enumValues>
  <enumValues>
    <name>ФормаРГ00002</name>
  </enumValues>
  <enumValues>
    <name>СубсидияПострадавшимМСП</name>
  </enumValues>
  <enumValues>
    <name>ЭлементДляВыпускаНовыхПатчей</name>
  </enumValues>
  <enumValues>
    <name>СубсидияПоПостановлению1513</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаДоходаЛицуНеИмеющемуПраваПолучения</name>
  </enumValues>
  <enumValues>
    <name>ОтзывЗапросаМотивированногоМнения</name>
  </enumValues>
  <enumValues>
    <name>ИсчисленныеСуммыНалогов</name>
  </enumValues>
  <enumValues>
    <name>ОсобыйПорядокУплатыНалогов</name>
  </enumValues>
  <enumValues>
    <name>ВозвратЕдиногоНалоговогоПлатежа</name>
  </enumValues>
  <enumValues>
    <name>СведенияОКадастровыхНомерах</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияОПараметрахДоступаИС</name>
  </enumValues>
  <enumValues>
    <name>ПоясненияПоСуммамНалогов</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/ВидыТорговойДеятельностиОблагаемыеСбором/ВидыТорговойДеятельностиОблагаемыеСбором.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыТорговойДеятельностиОблагаемыеСбором</name>
  <enumValues>
    <name>СтационарныеСетиБезТорговыхЗалов</name>
  </enumValues>
  <enumValues>
    <name>НестационарныеСети</name>
  </enumValues>
  <enumValues>
    <name>СтационарныеСетиСТорговымиЗалами</name>
  </enumValues>
  <enumValues>
    <name>ОтпускСоСклада</name>
  </enumValues>
  <enumValues>
    <name>РозничныеРынки</name>
  </enumValues>
  <enumValues>
    <name>РазвознаяРазноснаяТорговля</name>
  </enumValues>
  <enumValues>
    <name>ТорговыеАвтоматы</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/InformationRegisters/ПараметрыТорговыхТочек/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает строковое представление уведомления о постановке на учет в качестве плательщика
// торгового сбора.
//
// Параметры:
//  Уведомление - ДокументСсылка.УведомленияОСпецрежимахНалогообложения - ссылка на уведомление.
//
// Возвращаемое значение:
//  Строка - представление уведомления.
//
Функция ПредставлениеУведомления(Уведомление) Экспорт
	
	Результат = "";
	
	Если НЕ ЗначениеЗаполнено(Уведомление) Тогда
		Возврат Результат;
	КонецЕсли;
	
	// БРО может поменять структуру данных уведомлений.
	Попытка
		
		ДанныеУведомления = Уведомление.ДанныеУведомления.Получить();
		
		Если Уведомление.ВидУведомления = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаТС1 Тогда
			КодПричины = ДанныеУведомления.Титульный[0].КодПричины;
			
			Если КодПричины = "1" Тогда
				Представление = НСтр("ru='О постановке на учет в ИФНС %1'");
				
			ИначеЕсли КодПричины = "2" Тогда
				Представление = НСтр("ru='Об изменении параметров в ИФНС %1'");
				
			Иначе
				Представление = НСтр("ru='О снятии с учета в ИФНС %1'");
				
			КонецЕсли;
			
			Результат = СтрШаблон(Представление, ДанныеУведомления.Титульный[0].КОД_НО);
			
		ИначеЕсли Уведомление.ВидУведомления = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаТС2 Тогда
			Представление = НСтр("ru='О снятии с учета в ИФНС %1'");
			Результат = СтрШаблон(Представление, ДанныеУведомления.Титульный[0].КОД_НО);
			
		Иначе
			Результат = Строка(Уведомление);
			
		КонецЕсли;
		
	Исключение
		Результат = Строка(Уведомление);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Возвращает код льготы по наименованию.
//
// Параметры:
//  Льготы - ТаблицаЗначений - см. ТорговыйСбор.ПрочитатьТаблицуЛьгот().
//  НаименованиеЛьготы - Строка - Наименование льготы из поставляемых данных
//                                РегистрСведений.ПараметрыТорговыхТочек.Макеты.Льготы.
//  ТипТорговойТочки - ПеречислениеСсылка.ТипыТорговыхТочек - Тип торговой точки.
//
// Возвращаемое значение:
//  Строка - код налоговой льготы.
//
Функция КодЛьготыПоНаименованию(Льготы, НаименованиеЛьготы, ТипТорговойТочки) Экспорт
	
	Отбор = Новый Структура("Наименование, ТипТорговойТочки", НаименованиеЛьготы, ТипТорговойТочки);
	ПредставлениеЛьготы = Льготы.НайтиСтроки(Отбор);
	
	Если ПредставлениеЛьготы.Количество() = 1 Тогда
		Возврат ПредставлениеЛьготы[0].КодНалоговойЛьготы;
		
	Иначе
		// Код налоговой льготы "Не применяется".
		Возврат "000000000000";
		
	КонецЕсли;
	
КонецФункции

// Возвращает наименование налоговой льготы по коду.
//
// Параметры:
//  Льготы - ТаблицаЗначений - см. ТорговыйСбор.ПрочитатьТаблицуЛьгот().
//  КодНалоговойЛьготы - Строка - Код налоговой льготы.
//  ТипТорговойТочки - ПеречислениеСсылка.ТипыТорговыхТочек - Тип торговой точки.
//
// Возвращаемое значение:
//  Строка - Наименование льготы из поставляемых данных
//           РегистрСведений.ПараметрыТорговыхТочек.Макеты.Льготы.
//
Функция НаименованиеПоКодуЛьготы(Льготы, КодНалоговойЛьготы, ТипТорговойТочки) Экспорт
	
	Отбор = Новый Структура("КодНалоговойЛьготы, ТипТорговойТочки", КодНалоговойЛьготы, ТипТорговойТочки);
	ПредставлениеЛьготы = Льготы.НайтиСтроки(Отбор);
	
	Если ПредставлениеЛьготы.Количество() = 1 Тогда
		Возврат ПредставлениеЛьготы[0].Наименование;
		
	Иначе
		Возврат НСтр("ru='Не применяется'");
		
	КонецЕсли;
	
КонецФункции

// Расчет суммы уплачиваемого торгового сбора по торговой точке. Результат расчета сохраняется в 
// ПараметрыТорговойТочки.
//
// Параметры:
//  ПараметрыТорговойТочки - РегистрСведенийМенеджерЗаписи.ПараметрыТорговыхТочек - Параметры торговой точки.
//  СтавкиСбора - ТаблицаЗначений - см. ТорговыйСбор.ПрочитатьТаблицуСтавок().
//  Территории  - ТаблицаЗначений - см. ТорговыйСбор.ПрочитатьТаблицуТерриторий().
//
Процедура РассчитатьСуммуСбора(ПараметрыТорговойТочки, СтавкиСбора, Территории) Экспорт
	
	Если НЕ ДанныеДляРасчетаСтавкиУказаны(ПараметрыТорговойТочки) Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("КодПоОКТМО", СокрЛП(ПараметрыТорговойТочки.КодПоОКТМО));
	Если ТипЗнч(Территории) = Тип("ТаблицаЗначений") Тогда
		ТаблицаТерриторий = Территории.Скопировать(Отбор, "Территория");
	Иначе
		ТаблицаТерриторий = Территории.Выгрузить(Отбор, "Территория");
	КонецЕсли;
	
	Если ТаблицаТерриторий.Количество() = 0 Тогда
		Территория = Справочники.ТерриторииОсуществленияТорговойДеятельности.ПустаяСсылка();
	Иначе
		Территория = ТаблицаТерриторий[0].Территория;
	КонецЕсли;
	
	Отбор = Новый Структура("Территория, ВидТорговойДеятельности", Территория, ПараметрыТорговойТочки.ВидТорговойДеятельности);
	
	Если ТипЗнч(СтавкиСбора) = Тип("ТаблицаЗначений") Тогда
		ТаблицаСтавок = СтавкиСбора.Скопировать(Отбор);
	Иначе
		ТаблицаСтавок = СтавкиСбора.Выгрузить(Отбор);
	КонецЕсли;
	
	ЕстьТорговыйЗал = ЕстьТорговыйЗал(ПараметрыТорговойТочки.ТипТорговойТочки);
	
	СтавкаСбораНайдена = Ложь;
	Для Каждого СтавкаСбора Из ТаблицаСтавок Цикл
		ТорговаяТочкаПериод  = НачалоДня(ПараметрыТорговойТочки.Период);
		ПлощадьТорговогоЗала = ПараметрыТорговойТочки.ПлощадьТорговогоЗала;
		
		Если (СтавкаСбора.ДействуетС <= ТорговаяТочкаПериод И ТорговаяТочкаПериод <= СтавкаСбора.ДействуетПо)
			И (НЕ ЕстьТорговыйЗал 
				ИЛИ (СтавкаСбора.НижняяГраница < ПлощадьТорговогоЗала И  ПлощадьТорговогоЗала <= СтавкаСбора.ВерхняяГраница)) Тогда
			
			СтавкаСбораНайдена = Истина;
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ СтавкаСбораНайдена Тогда
		ПараметрыТорговойТочки.СуммаСбора         = 0;
		ПараметрыТорговойТочки.Ставка             = 0;
		ПараметрыТорговойТочки.СуммаЛьготы        = 0;
		ПараметрыТорговойТочки.РасшифровкаРасчета = НСтр("ru='Не удалось автоматически рассчитать ставку на основании введенных данных о торговой точке.
			|Возможно, допущена ошибка в адресе или коде ОКТМО. Проверьте указанные данные или укажите сумму уплачиваемого сбора самостоятельно.'");
		Возврат;
	КонецЕсли;
	
	Если ПараметрыТорговойТочки.ТипТорговойТочки = Перечисления.ТипыТорговыхТочек.РозничныйРынок Тогда
		ПараметрыТорговойТочки.СуммаСбора = СтавкаСбора.Превышение * ПараметрыТорговойТочки.ПлощадьТорговогоЗала;
		ПараметрыТорговойТочки.Ставка = ПараметрыТорговойТочки.СуммаСбора;
		
	Иначе
		Если ЕстьТорговыйЗал И СтавкаСбора.Превышение > 0 Тогда
			// Если ставка сложная (базовая + превышение), то для уведомления используем расчетную ставку за кв.м.
			СтавкаЗаМетр = РасчетнаяСтавкаЗаМетр(ПараметрыТорговойТочки, СтавкаСбора);
			ПараметрыТорговойТочки.Ставка = СтавкаЗаМетр * ПараметрыТорговойТочки.ПлощадьТорговогоЗала;
		Иначе
			ПараметрыТорговойТочки.Ставка = СтавкаСбора.БазоваяСтавка;
		КонецЕсли;
		
		Если ПрименяетсяЛьгота(ПараметрыТорговойТочки.КодНалоговойЛьготы) Тогда
			// применение льготы освобождает от уплаты торгового сбора
			ПараметрыТорговойТочки.СуммаСбора = 0;
			ПараметрыТорговойТочки.СуммаЛьготы = ПараметрыТорговойТочки.Ставка;
			
		Иначе
			ПараметрыТорговойТочки.СуммаСбора = ПараметрыТорговойТочки.Ставка;
			ПараметрыТорговойТочки.СуммаЛьготы = 0;
		КонецЕсли;
	КонецЕсли;
	
	СоздатьРасшифровкуРасчетаСуммыСбора(ПараметрыТорговойТочки, СтавкаСбора);
	
КонецПроцедуры

// Возвращает значение параметров торговой точки на дату.
//
// Параметры:
//  ТорговаяТочка - СправочникСсылка.ТорговыеТочки - Торговая точка.
//  НаДату        - Дата - Дата на которую будут получены параметры торговой точки.
//
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - значение параметров торговой точки.
//
Функция ПараметрыТорговойТочки(ТорговаяТочка, НаДату) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаДату"       , НаДату);
	Запрос.УстановитьПараметр("ТорговаяТочка", ТорговаяТочка);
	Запрос.УстановитьПараметр("Организация"  , ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТорговаяТочка, "Организация"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПараметрыТорговыхТочекСрезПоследних.Период,
	|	ПараметрыТорговыхТочекСрезПоследних.Организация,
	|	ПараметрыТорговыхТочекСрезПоследних.ТорговаяТочка,
	|	ПараметрыТорговыхТочекСрезПоследних.КодПоОКТМО,
	|	ПараметрыТорговыхТочекСрезПоследних.ВидТорговойДеятельности,
	|	ПараметрыТорговыхТочекСрезПоследних.ОснованиеПользования,
	|	ПараметрыТорговыхТочекСрезПоследних.ПостановкаНаУчетВНалоговомОргане,
	|	ПараметрыТорговыхТочекСрезПоследних.НалоговыйОрган,
	|	ПараметрыТорговыхТочекСрезПоследних.ВидОбъектаНедвижимости,
	|	ПараметрыТорговыхТочекСрезПоследних.КадастровыйНомер,
	|	ПараметрыТорговыхТочекСрезПоследних.НомерРазрешения,
	|	ПараметрыТорговыхТочекСрезПоследних.ПлощадьТорговогоЗала,
	|	ПараметрыТорговыхТочекСрезПоследних.КодНалоговойЛьготы,
	|	ПараметрыТорговыхТочекСрезПоследних.Ставка,
	|	ПараметрыТорговыхТочекСрезПоследних.СуммаЛьготы,
	|	ПараметрыТорговыхТочекСрезПоследних.СуммаСбора,
	|	ПараметрыТорговыхТочекСрезПоследних.РасшифровкаРасчета,
	|	ПараметрыТорговыхТочекСрезПоследних.ТипТорговойТочки,
	|	ПараметрыТорговыхТочекСрезПоследних.ВидОперации
	|ИЗ
	|	РегистрСведений.ПараметрыТорговыхТочек.СрезПоследних(
	|			&НаДату,
	|			ТорговаяТочка = &ТорговаяТочка
	|				И Организация = &Организация) КАК ПараметрыТорговыхТочекСрезПоследних";
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьТорговыйЗал(ТипТорговойТочки)
	
	Результат = Ложь;
	
	Если ТипТорговойТочки = Перечисления.ТипыТорговыхТочек.Магазин
		ИЛИ ТипТорговойТочки = Перечисления.ТипыТорговыхТочек.Павильон
		ИЛИ ТипТорговойТочки = Перечисления.ТипыТорговыхТочек.ПрочееСТорговымЗалом
		ИЛИ ТипТорговойТочки = Перечисления.ТипыТорговыхТочек.РозничныйРынок Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПревышениеБазовойПлощади(ПлощадьЗала, БазоваяПлощадь)
	Если БазоваяПлощадь = 0 Тогда
		Возврат 0;
	КонецЕсли; 
	
	ПлощадьЗалаСвышеБазовой = ПлощадьЗала - БазоваяПлощадь;
	
	Если ПлощадьЗалаСвышеБазовой < 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	ЦелаяЧасть = Цел(ПлощадьЗалаСвышеБазовой);
	
	Если ПлощадьЗалаСвышеБазовой - ЦелаяЧасть > 0 Тогда
		ПлощадьЗалаСвышеБазовой = ЦелаяЧасть + 1;
	КонецЕсли;
	
	Возврат ПлощадьЗалаСвышеБазовой;
	
КонецФункции

Функция ПрименяетсяЛьгота(КодНалоговойЛьготы)
	
	Возврат ЗначениеЗаполнено(Число(КодНалоговойЛьготы));
	
КонецФункции

Функция ДанныеДляРасчетаСтавкиУказаны(ПараметрыТорговойТочки)
	
	Если ЗначениеЗаполнено(ПараметрыТорговойТочки.ТипТорговойТочки)
		И ЗначениеЗаполнено(ПараметрыТорговойТочки.Период)
		И ЗначениеЗаполнено(ПараметрыТорговойТочки.КодПоОКТМО) Тогда
		
		Результат = Истина;
		
	Иначе
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СоздатьРасшифровкуРасчетаСуммыСбора(ПараметрыТорговойТочки, СтавкаСбора)
	
	Если ПараметрыТорговойТочки.ТипТорговойТочки = Перечисления.ТипыТорговыхТочек.ТорговыйАвтомат Тогда
		
		Если ПрименяетсяЛьгота(ПараметрыТорговойТочки.КодНалоговойЛьготы) Тогда
			РасшифровкаРасчета = НСтр("ru='Торговля, осуществляемая с использованием вендинговых автоматов, не облагается сбором.'");
		Иначе
			РасшифровкаРасчета = НСтр("ru='Размер торгового сбора для торговли с использованием вендинговых автоматов фиксирован и составляет %1 руб.'");
			РасшифровкаРасчета = СтрШаблон(РасшифровкаРасчета, ПараметрыТорговойТочки.Ставка);
		КонецЕсли;
		
	ИначеЕсли ПрименяетсяЛьгота(ПараметрыТорговойТочки.КодНалоговойЛьготы) Тогда
		РасшифровкаРасчета = НСтр("ru='В случае применения льготы торговый сбор не уплачивается.'");
		
	ИначеЕсли ПараметрыТорговойТочки.ВидТорговойДеятельности =
		Перечисления.ВидыТорговойДеятельностиОблагаемыеСбором.РазвознаяРазноснаяТорговля Тогда
		
		РасшифровкаРасчета = НСтр("ru='Размер торгового сбора для развозной (разносной) торговли фиксирован и составляет %1 руб.'");
		РасшифровкаРасчета = СтрШаблон(РасшифровкаРасчета, ПараметрыТорговойТочки.Ставка);
		
	ИначеЕсли ПараметрыТорговойТочки.ВидТорговойДеятельности =
		Перечисления.ВидыТорговойДеятельностиОблагаемыеСбором.СтационарныеСетиСТорговымиЗалами
		И ПараметрыТорговойТочки.ПлощадьТорговогоЗала > 50 Тогда
		
		РасшифровкаРасчета = НСтр("ru='Торговый сбор = Расчетная ставка за кв.м. * Площадь торгового зала
			| Расчетная ставка за кв.м. = (Ставка за %9 кв.м. + (Площадь свыше %9 кв.м. * Ставка за полный кв.м. свыше %9 кв.м)) / Площадь торгового зала
			| Расчетная ставка за кв.м. = (%1 руб. + (%2 кв.м. * %3 руб.)) / %4 кв.м. = %5 руб.
			| Торговый сбор = %6 руб * %7 кв.м. = %8 руб.'");
		РасчетнаяСтавкаЗаМетр = РасчетнаяСтавкаЗаМетр(ПараметрыТорговойТочки, СтавкаСбора);
		РасшифровкаРасчета = СтрШаблон(РасшифровкаРасчета,
			СтавкаСбора.БазоваяСтавка,
			ПревышениеБазовойПлощади(ПараметрыТорговойТочки.ПлощадьТорговогоЗала, СтавкаСбора.НижняяГраница),
			СтавкаСбора.Превышение,
			ПараметрыТорговойТочки.ПлощадьТорговогоЗала,
			РасчетнаяСтавкаЗаМетр,
			РасчетнаяСтавкаЗаМетр,
			ПараметрыТорговойТочки.ПлощадьТорговогоЗала,
			ПараметрыТорговойТочки.Ставка,
			СтавкаСбора.НижняяГраница);
			
	ИначеЕсли ПараметрыТорговойТочки.ВидТорговойДеятельности =
		Перечисления.ВидыТорговойДеятельностиОблагаемыеСбором.СтационарныеСетиСТорговымиЗалами
		И СтавкаСбора.НижняяГраница = 0  Тогда
		
		РасшифровкаРасчета = НСтр("ru='Размер торгового сбора для торговых точек с площадью торгового зала менее %2 кв.м
			|фиксирован и составляет %1 руб.'");
		РасшифровкаРасчета = СтрШаблон(РасшифровкаРасчета, ПараметрыТорговойТочки.Ставка, СтавкаСбора.ВерхняяГраница);
		
	ИначеЕсли ПараметрыТорговойТочки.ТипТорговойТочки = Перечисления.ТипыТорговыхТочек.РозничныйРынок Тогда
		РасшифровкаРасчета = НСтр("ru='Торговый сбор = Площадь рынка * Ставка
			|%1 кв.м. * %2 руб. = %3 руб.'");
			
		РасшифровкаРасчета = СтрШаблон(РасшифровкаРасчета,
			ПараметрыТорговойТочки.ПлощадьТорговогоЗала,
			СтавкаСбора.Превышение,
			ПараметрыТорговойТочки.Ставка);
			
	Иначе
		РасшифровкаРасчета = НСтр("ru='Размер торгового сбора, зависит от адреса торговой точки и составляет %1 руб.'");
		РасшифровкаРасчета = СтрШаблон(РасшифровкаРасчета, ПараметрыТорговойТочки.Ставка);
		
	КонецЕсли;
	
	ПараметрыТорговойТочки.РасшифровкаРасчета = РасшифровкаРасчета;
	
КонецПроцедуры

Функция РасчетнаяСтавкаЗаМетр(ПараметрыТорговойТочки, СтавкаСбора)
	РасчетнаяСтавкаЗаМетр = (СтавкаСбора.БазоваяСтавка + ПревышениеБазовойПлощади(ПараметрыТорговойТочки.ПлощадьТорговогоЗала, СтавкаСбора.НижняяГраница) * СтавкаСбора.Превышение)
		/ ПараметрыТорговойТочки.ПлощадьТорговогоЗала;
	РасчетнаяСтавкаЗаМетр = Окр(РасчетнаяСтавкаЗаМетр, 2);
	
	Возврат РасчетнаяСтавкаЗаМетр
	
КонецФункции

Функция ЗаписиИдентичны(Запись1, Запись2)

	МетаданныеРегистрСведений = Метаданные.РегистрыСведений.ПараметрыТорговыхТочек;
	
	Для каждого Измерение Из МетаданныеРегистрСведений.Измерения Цикл
		Если Запись1[Измерение.Имя] <> Запись2[Измерение.Имя] Тогда
			Возврат Ложь;
		КонецЕсли; 
	КонецЦикла; 
	
	Для каждого Ресурс Из МетаданныеРегистрСведений.Ресурсы Цикл
		Если Запись1[Ресурс.Имя] <> Запись2[Ресурс.Имя] Тогда
			Возврат Ложь;
		КонецЕсли; 
	КонецЦикла; 
	
	Для каждого Реквизит Из МетаданныеРегистрСведений.Реквизиты Цикл
		Если Запись1[Реквизит.Имя] <> Запись2[Реквизит.Имя] Тогда
			Возврат Ложь;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Истина;
КонецФункции 
 

Процедура ОбновитьСтавкиПоСпискуТорговыхТочек(ПараметрыТорговыхТочек, НаДату)
	
	ТаблицаСтавок = ТорговыйСбор.ПрочитатьТаблицуСтавок();
	ТаблицаТерриторий = ТорговыйСбор.ПрочитатьТаблицуТерриторий();
	
	Для Каждого ПараметрыТорговойТочки Из ПараметрыТорговыхТочек Цикл

		ИсходныеПараметрыТорговойТочки = РегистрыСведений.ПараметрыТорговыхТочек.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ИсходныеПараметрыТорговойТочки, ПараметрыТорговойТочки, "Период, Организация, ТорговаяТочка");
		ИсходныеПараметрыТорговойТочки.Прочитать();
		
		ДатаНовойЗаписи = Макс(ИсходныеПараметрыТорговойТочки.Период, НаДату);
		
		НаборЗаписейПараметрыТорговойТочки = РегистрыСведений.ПараметрыТорговыхТочек.СоздатьНаборЗаписей();
		НаборЗаписейПараметрыТорговойТочки.Отбор.Период.Установить(ДатаНовойЗаписи);
		НаборЗаписейПараметрыТорговойТочки.Отбор.Организация.Установить(ИсходныеПараметрыТорговойТочки.Организация);
		НаборЗаписейПараметрыТорговойТочки.Отбор.ТорговаяТочка.Установить(ИсходныеПараметрыТорговойТочки.ТорговаяТочка);
		
		НоваяЗаписьПараметрыТорговойТочки = НаборЗаписейПараметрыТорговойТочки.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяЗаписьПараметрыТорговойТочки, ИсходныеПараметрыТорговойТочки, , "Период");
		ЗаполнитьЗначенияСвойств(НоваяЗаписьПараметрыТорговойТочки, ПараметрыТорговойТочки, , "Период");
		
		НоваяЗаписьПараметрыТорговойТочки.Период = ДатаНовойЗаписи;
		
		РассчитатьСуммуСбора(НоваяЗаписьПараметрыТорговойТочки, ТаблицаСтавок, ТаблицаТерриторий);
		
		Если НЕ ЗаписиИдентичны(НоваяЗаписьПараметрыТорговойТочки, ИсходныеПараметрыТорговойТочки) Тогда
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписейПараметрыТорговойТочки);
		КонецЕсли; 
		
	КонецЦикла;

КонецПроцедуры
 

#Область ОбработчикиОбновления

Процедура ОбновитьСтавкиТорговогоСбора() Экспорт
	
	ДатаПроверкиСтавки = Дата(2019, 07, 01);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаПроверкиСтавки", ДатаПроверкиСтавки);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПараметрыТорговыхТочекСрезПоследних.Период КАК Период,
	|	ПараметрыТорговыхТочекСрезПоследних.Организация КАК Организация,
	|	ПараметрыТорговыхТочекСрезПоследних.ТорговаяТочка КАК ТорговаяТочка,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийТорговыеТочки.ИзменениеПараметров) КАК ВидОперации
	|ИЗ
	|	РегистрСведений.ПараметрыТорговыхТочек.СрезПоследних(&ДатаПроверкиСтавки, ) КАК ПараметрыТорговыхТочекСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыТорговыхТочек КАК ПараметрыТорговыхТочекНаДатуСреза
	|		ПО ПараметрыТорговыхТочекСрезПоследних.Организация = ПараметрыТорговыхТочекНаДатуСреза.Организация
	|			И ПараметрыТорговыхТочекСрезПоследних.ТорговаяТочка = ПараметрыТорговыхТочекНаДатуСреза.ТорговаяТочка
	|			И (ПараметрыТорговыхТочекНаДатуСреза.Период = &ДатаПроверкиСтавки)
	|ГДЕ
	|	ПараметрыТорговыхТочекСрезПоследних.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийТорговыеТочки.СнятиеСУчета)
	|	И ПараметрыТорговыхТочекСрезПоследних.ВидТорговойДеятельности = ЗНАЧЕНИЕ(Перечисление.ВидыТорговойДеятельностиОблагаемыеСбором.СтационарныеСетиСТорговымиЗалами)
	|	И ПараметрыТорговыхТочекНаДатуСреза.Период ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПараметрыТорговыхТочек.Период,
	|	ПараметрыТорговыхТочек.Организация,
	|	ПараметрыТорговыхТочек.ТорговаяТочка,
	|	ПараметрыТорговыхТочек.ВидОперации
	|ИЗ
	|	РегистрСведений.ПараметрыТорговыхТочек КАК ПараметрыТорговыхТочек
	|ГДЕ
	|	ПараметрыТорговыхТочек.Период >= &ДатаПроверкиСтавки
	|	И ПараметрыТорговыхТочек.ВидТорговойДеятельности = ЗНАЧЕНИЕ(Перечисление.ВидыТорговойДеятельностиОблагаемыеСбором.СтационарныеСетиСТорговымиЗалами)";
	
	
	ПараметрыТорговыхТочек = Запрос.Выполнить().Выгрузить();
	
	ОбновитьСтавкиПоСпискуТорговыхТочек(ПараметрыТорговыхТочек, ДатаПроверкиСтавки);
	
КонецПроцедуры

Процедура ОбновитьСтавкиТорговыеАвтоматы() Экспорт

	ИзменитьВидТорговойДеятельностиТорговыеАвтоматы();
	
	ДатаПроверкиСтавки = Дата(2021, 01, 01);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаПроверкиСтавки", ДатаПроверкиСтавки);
	Запрос.УстановитьПараметр("ТипТорговыйАвтомат", Перечисления.ТипыТорговыхТочек.ТорговыйАвтомат);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПараметрыТорговыхТочекСрезПоследних.Период КАК Период,
	|	ПараметрыТорговыхТочекСрезПоследних.Организация КАК Организация,
	|	ПараметрыТорговыхТочекСрезПоследних.ТорговаяТочка КАК ТорговаяТочка,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийТорговыеТочки.ИзменениеПараметров) КАК ВидОперации,
	|	""000000000000"" КАК КодНалоговойЛьготы,
	|	"""" КАК РасшифровкаРасчета
	|ИЗ
	|	РегистрСведений.ПараметрыТорговыхТочек.СрезПоследних(&ДатаПроверкиСтавки, ) КАК ПараметрыТорговыхТочекСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыТорговыхТочек КАК ПараметрыТорговыхТочекНаДатуСреза
	|		ПО ПараметрыТорговыхТочекСрезПоследних.Организация = ПараметрыТорговыхТочекНаДатуСреза.Организация
	|			И ПараметрыТорговыхТочекСрезПоследних.ТорговаяТочка = ПараметрыТорговыхТочекНаДатуСреза.ТорговаяТочка
	|			И (ПараметрыТорговыхТочекНаДатуСреза.Период = &ДатаПроверкиСтавки)
	|ГДЕ
	|	ПараметрыТорговыхТочекСрезПоследних.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийТорговыеТочки.СнятиеСУчета)
	|	И ПараметрыТорговыхТочекСрезПоследних.ТипТорговойТочки = &ТипТорговыйАвтомат
	|	И ПараметрыТорговыхТочекНаДатуСреза.Период ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПараметрыТорговыхТочек.Период,
	|	ПараметрыТорговыхТочек.Организация,
	|	ПараметрыТорговыхТочек.ТорговаяТочка,
	|	ПараметрыТорговыхТочек.ВидОперации,
	|	""000000000000"",
	|	""""
	|ИЗ
	|	РегистрСведений.ПараметрыТорговыхТочек КАК ПараметрыТорговыхТочек
	|ГДЕ
	|	ПараметрыТорговыхТочек.Период >= &ДатаПроверкиСтавки
	|	И ПараметрыТорговыхТочек.ТипТорговойТочки = &ТипТорговыйАвтомат";
	
	
	ПараметрыТорговыхТочек = Запрос.Выполнить().Выгрузить();
	
	ОбновитьСтавкиПоСпискуТорговыхТочек(ПараметрыТорговыхТочек, ДатаПроверкиСтавки);

КонецПроцедуры

Процедура ИзменитьВидТорговойДеятельностиТорговыеАвтоматы() 
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТипТорговыйАвтомат", Перечисления.ТипыТорговыхТочек.ТорговыйАвтомат);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыТорговыхТочек.Организация КАК Организация,
	|	ПараметрыТорговыхТочек.ТорговаяТочка КАК ТорговаяТочка
	|ИЗ
	|	РегистрСведений.ПараметрыТорговыхТочек КАК ПараметрыТорговыхТочек
	|ГДЕ
	|	ПараметрыТорговыхТочек.ТипТорговойТочки = &ТипТорговыйАвтомат";
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ПараметрыТорговыхТочек.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Результат.Организация);
		НаборЗаписей.Отбор.ТорговаяТочка.Установить(Результат.ТорговаяТочка);
		
		НаборЗаписей.Прочитать();
		Для каждого Запись Из НаборЗаписей Цикл
		
			Если Запись.ТипТорговойТочки = Перечисления.ТипыТорговыхТочек.ТорговыйАвтомат Тогда
				Запись.ВидТорговойДеятельности = Перечисления.ВидыТорговойДеятельностиОблагаемыеСбором.ТорговыеАвтоматы;
			КонецЕсли; 
		
		КонецЦикла; 
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	КонецЦикла; 
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
